app/controllers/application_controller.rb

        def authorize_request
          header = request.headers['Authorization']
          token = header.split(' ').last if header
          begin
            @decoded = decode(token)
            @current_user = User.find(@decoded[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]