app/controllers/days_controller.rb

    def index
      @days = Day.all
---
SELECT "days".* FROM "days"

    def create
      @day = Day.new(day_params)
      @day.user = @current_user

      if @day.save
---
INSERT INTO "days" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 30], ["created_at", "2020-12-05 21:00:03.218740"], ["updated_at", "2020-12-05 21:00:03.218740"]]

    def destroy
      @day = Day.find(params[:id])
---
SELECT "days".* FROM "days" WHERE "days"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

      def set_user_day
        @day = @current_user.days.find(params[:id])
---
SELECT "days".* FROM "days" WHERE "days"."user_id" = $1 AND "days"."id" = $2 LIMIT $3  [["user_id", 30], ["id", 7], ["LIMIT", 1]]