app/controllers/meals_controller.rb

    def index
        @meals = Meal.all
---
SELECT "meals".* FROM "meals"

    def destroy
        @meal = Meal.find(params[:id])
        @meal.destroy
---
SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
DELETE FROM "meals" WHERE "meals"."id" = $1  [["id", 20]]

    def create
        @meal = Meal.new(meal_params)
        if @meal.save
---
INSERT INTO "meals" ("name", "day_id", "calories", "protein", "carbs", "fats", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["name", "a"], ["day_id", 2], ["calories", 0], ["protein", 0], ["carbs", 0], ["fats", 0], ["created_at", "2020-12-05 23:11:20.956671"], ["updated_at", "2020-12-05 23:11:20.956671"]]

    def update
        @meal = Meal.find(params[:id])
        if @meal.update(meal_params)
---
SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "meals" SET "calories" = $1, "protein" = $2, "fats" = $3, "carbs" = $4, "updated_at" = $5 WHERE "meals"."id" = $6  [["calories", 0], ["protein", 666], ["fats", 789], ["carbs", 88], ["updated_at", "2020-12-05 23:43:15.011423"], ["id", 16]]